package Lecture1;

public class Task1 {
    // Задание по условию "1"
    String name1 = "Tom";
    String name2 = "Mike";
    String name3 = "Jessy";

    public static void main(String[] args) {

        // задание по условию "2"
//        int number = 10;
//        System.out.println();
        String str = "Когда я вырасту, то хочу быть паровым экскаватором!";
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);
        System.out.println(str);

        System.out.println("Меня зовут Амиго.");
        System.out.print("\n");
        System.out.println("Я согласен на зарплату $800/месяц в первый год.");
        System.out.println("Я согласен на зарплату $1500/месяц во второй год.");
        System.out.println("Я согласен на зарплату $2200/месяц в третий год.");
        System.out.println("Я согласен на зарплату $2700/месяц в четвертый год.");
        System.out.println("Я согласен на зарплату $3200/месяц в пятый год.");
        System.out.print("\n");
        System.out.println("Поцелуй мой блестящий металлический зад!");
//        int i = 0;
//        while (i < 10) {
//            System.out.println("Когда я вырасту, то хочу быть паровым экскаватором!");
//            i++;
//        }
    }
}
