package Lecture3;

//Вывести на экран произведение чисел от 1 до 10.
public class Task4 {
    public static void main(String[] args) {
        System.out.println(1 * 2 * 3 * 4 * 5 * 6 * 7 * 8 * 9 * 10);
    }
}
