package Lecture3;

//Вывести на экран дату своего рождения в виде: MAY 1 2012
public class Task1 {
    public static void main(String[] args) {
        System.out.println("MAY 26 1987");
    }
}
